Pranav-Karra-3301/busybar-firmware/scripts/STM32U595x.svd
        <register>
          <name>MDF_DFLT2ISR</name>
          <displayName>MDF_DFLT2ISR</displayName>
          <description>This register contains the status flags for each digital filter path.</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FTHF</name>
              <description>RXFIFO threshold flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that the RXFIFO threshold is not reached, writing  0  has no effect. - 1: Reading  1  means that the RXFIFO reached the threshold, writing  1  clears this flag.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVRF</name>
              <description>Data overflow flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no overflow is detected, writing  0  has no effect. - 1: Reading  1  means that an overflow is detected, writing  1  clears this flag.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSDRF</name>
              <description>Snapshot data ready flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no data is available on MDF_SNPSxDR, writing  0  has no effect. - 1: Reading  1  means that a new data is available on MDF_SNPSxDR, writing  1  clears this flag.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNEF</name>
              <description>RXFIFO Not Empty flag Set and cleared by hardware according to the RXFIFO level. - 0: Reading  0  means that the RXFIFO is empty. - 1: Reading  1  means that the RXFIFO is not empty.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OLDF</name>
              <description>Out-of Limit Detector flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no OLD event is detected, writing  0  has no effect. - 1: Reading  1  means that an OLD event is detected, writing  1  clears THHF, THLF and OLDF flags.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THLF</name>
              <description>Low threshold status flag Set by hardware, and cleared by software by writing OLDF bit to  1 . This flag indicates the status of the low threshold comparator when the last OLD event occurred. This bit gives additional information on the conditions triggering the last OLD event. It can be cleared by writing OLDF flag to    a   1. - 0: The signal was lower than OLDTHL, when the last OLD event occurred - 1: The signal was higher than OLDTHL, when the last OLD event occurred</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>THHF</name>
              <description>High threshold status flag Set by hardware, and cleared by software by writing OLDF bit to  1 . This flag indicates the status of the high threshold comparator when the last OLD event occurred. This bit gives additional information on the conditions triggering the last OLD event. It can be cleared by writing OLDF flag to    a   1. - 0: The signal was lower than OLDTHH, when the last OLD event occurred - 1: The signal was higher than OLDTHH, when the last OLD event occurred</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSOVRF</name>
              <description>Snapshot overrun flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no snapshot overrun event is detected, writing  0  has no effect. - 1: Reading  1  means that a snapshot overrun event is detected, writing  1  clears this flag.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCDF</name>
              <description>Short-Circuit Detector flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no SCD event is detected, writing  0  has no effect. - 1: Reading  1  means that a SCD event is detected, writing  1  clears this flag.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SATF</name>
              <description>Saturation detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no saturation is detected, writing  0  has no effect. - 1: Reading  1  means that a saturation is detected, writing  1  clears this flag.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKABF</name>
              <description>Clock absence detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no clock absence is detected, writing  0  has no effect. - 1: Reading  1  means that a clock absence is detected, writing  1  clears this flag.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOVRF</name>
              <description>Reshape Filter Overrun detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no reshape filter overrun is detected, writing  0  has no effect. - 1: Reading  1  means that reshape filter overrun is detected, writing  1  clears this flag.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT3ISR</name>
          <displayName>MDF_DFLT3ISR</displayName>
          <description>This register contains the status flags for each digital filter path.</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FTHF</name>
              <description>RXFIFO threshold flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that the RXFIFO threshold is not reached, writing  0  has no effect. - 1: Reading  1  means that the RXFIFO reached the threshold, writing  1  clears this flag.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVRF</name>
              <description>Data overflow flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no overflow is detected, writing  0  has no effect. - 1: Reading  1  means that an overflow is detected, writing  1  clears this flag.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSDRF</name>
              <description>Snapshot data ready flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no data is available on MDF_SNPSxDR, writing  0  has no effect. - 1: Reading  1  means that a new data is available on MDF_SNPSxDR, writing  1  clears this flag.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNEF</name>
              <description>RXFIFO Not Empty flag Set and cleared by hardware according to the RXFIFO level. - 0: Reading  0  means that the RXFIFO is empty. - 1: Reading  1  means that the RXFIFO is not empty.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OLDF</name>
              <description>Out-of Limit Detector flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no OLD event is detected, writing  0  has no effect. - 1: Reading  1  means that an OLD event is detected, writing  1  clears THHF, THLF and OLDF flags.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THLF</name>
              <description>Low threshold status flag Set by hardware, and cleared by software by writing OLDF bit to  1 . This flag indicates the status of the low threshold comparator when the last OLD event occurred. This bit gives additional information on the conditions triggering the last OLD event. It can be cleared by writing OLDF flag to    a   1. - 0: The signal was lower than OLDTHL, when the last OLD event occurred - 1: The signal was higher than OLDTHL, when the last OLD event occurred</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>THHF</name>
              <description>High threshold status flag Set by hardware, and cleared by software by writing OLDF bit to  1 . This flag indicates the status of the high threshold comparator when the last OLD event occurred. This bit gives additional information on the conditions triggering the last OLD event. It can be cleared by writing OLDF flag to    a   1. - 0: The signal was lower than OLDTHH, when the last OLD event occurred - 1: The signal was higher than OLDTHH, when the last OLD event occurred</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSOVRF</name>
              <description>Snapshot overrun flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no snapshot overrun event is detected, writing  0  has no effect. - 1: Reading  1  means that a snapshot overrun event is detected, writing  1  clears this flag.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCDF</name>
              <description>Short-Circuit Detector flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no SCD event is detected, writing  0  has no effect. - 1: Reading  1  means that a SCD event is detected, writing  1  clears this flag.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SATF</name>
              <description>Saturation detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no saturation is detected, writing  0  has no effect. - 1: Reading  1  means that a saturation is detected, writing  1  clears this flag.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKABF</name>
              <description>Clock absence detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no clock absence is detected, writing  0  has no effect. - 1: Reading  1  means that a clock absence is detected, writing  1  clears this flag.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOVRF</name>
              <description>Reshape Filter Overrun detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no reshape filter overrun is detected, writing  0  has no effect. - 1: Reading  1  means that reshape filter overrun is detected, writing  1  clears this flag.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT4ISR</name>
          <displayName>MDF_DFLT4ISR</displayName>
          <description>This register contains the status flags for each digital filter path.</description>
          <addressOffset>0x2B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FTHF</name>
              <description>RXFIFO threshold flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that the RXFIFO threshold is not reached, writing  0  has no effect. - 1: Reading  1  means that the RXFIFO reached the threshold, writing  1  clears this flag.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVRF</name>
              <description>Data overflow flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no overflow is detected, writing  0  has no effect. - 1: Reading  1  means that an overflow is detected, writing  1  clears this flag.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSDRF</name>
              <description>Snapshot data ready flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no data is available on MDF_SNPSxDR, writing  0  has no effect. - 1: Reading  1  means that a new data is available on MDF_SNPSxDR, writing  1  clears this flag.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNEF</name>
              <description>RXFIFO Not Empty flag Set and cleared by hardware according to the RXFIFO level. - 0: Reading  0  means that the RXFIFO is empty. - 1: Reading  1  means that the RXFIFO is not empty.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OLDF</name>
              <description>Out-of Limit Detector flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no OLD event is detected, writing  0  has no effect. - 1: Reading  1  means that an OLD event is detected, writing  1  clears THHF, THLF and OLDF flags.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THLF</name>
              <description>Low threshold status flag Set by hardware, and cleared by software by writing OLDF bit to  1 . This flag indicates the status of the low threshold comparator when the last OLD event occurred. This bit gives additional information on the conditions triggering the last OLD event. It can be cleared by writing OLDF flag to    a   1. - 0: The signal was lower than OLDTHL, when the last OLD event occurred - 1: The signal was higher than OLDTHL, when the last OLD event occurred</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>THHF</name>
              <description>High threshold status flag Set by hardware, and cleared by software by writing OLDF bit to  1 . This flag indicates the status of the high threshold comparator when the last OLD event occurred. This bit gives additional information on the conditions triggering the last OLD event. It can be cleared by writing OLDF flag to    a   1. - 0: The signal was lower than OLDTHH, when the last OLD event occurred - 1: The signal was higher than OLDTHH, when the last OLD event occurred</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSOVRF</name>
              <description>Snapshot overrun flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no snapshot overrun event is detected, writing  0  has no effect. - 1: Reading  1  means that a snapshot overrun event is detected, writing  1  clears this flag.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCDF</name>
              <description>Short-Circuit Detector flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no SCD event is detected, writing  0  has no effect. - 1: Reading  1  means that a SCD event is detected, writing  1  clears this flag.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SATF</name>
              <description>Saturation detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no saturation is detected, writing  0  has no effect. - 1: Reading  1  means that a saturation is detected, writing  1  clears this flag.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKABF</name>
              <description>Clock absence detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no clock absence is detected, writing  0  has no effect. - 1: Reading  1  means that a clock absence is detected, writing  1  clears this flag.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOVRF</name>
              <description>Reshape Filter Overrun detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no reshape filter overrun is detected, writing  0  has no effect. - 1: Reading  1  means that reshape filter overrun is detected, writing  1  clears this flag.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
